{"job_id": "b58e6bc3-daa2-451c-89a8-8963a2dc4d9d", "name": "Clean Disk Space", "description": "Clean disk space by deleting temporary files, clearing log files, and vacuuming system journal to free up storage when disk usage is high or server is running out of space."}
{"job_id": "7d35eedc-1b34-43a9-bcdc-c88b3d449adb", "name": "Clear Application Cache", "description": "Clear application cache for Django or Flask web apps by removing cached files, static assets, and temporary config data to fix stale configuration issues or high web latency."}
{"job_id": "3ef205b0-81f5-4680-91f0-938eb3e8194a", "name": "Flush DNS Cache", "description": "Flush and clear DNS cache on the server to fix DNS resolution errors, outdated domain records, and network name lookup failures."}
{"job_id": "7ebebeec-a4ec-441c-86c1-73b3c9f12933", "name": "Kill High CPU Process", "description": "Identify and terminate the process using the highest CPU to recover from performance degradation, system slowdowns, or CPU bottlenecks."}
{"job_id": "3651fdfb-1c15-47fd-83a5-e4801e9c5fb4", "name": "Kill High Memory Process", "description": "Terminate the process consuming the most RAM to reduce memory pressure, prevent out-of-memory errors, and restore system responsiveness."}
{"job_id": "ba7e27ff-4fa1-4b71-8670-273d27d0c730", "name": "Reclaim Docker Disk Space", "description": "Free Docker disk space by removing unused containers, images, and volumes to fix low disk alerts and optimize container storage usage."}
{"job_id": "4d40ad93-7ad5-4823-9fdd-2beb0886bc6f", "name": "Restart Docker Daemon", "description": "Restart Docker service (dockerd) to fix stuck containers, unresponsive Docker commands, or container networking issues."}
{"job_id": "58c4956c-608e-4ef0-abc1-e0607d6540b6", "name": "Restart Nginx Web Server", "description": "Restart the Nginx web server to resolve HTTP 5xx errors, service downtime, or misconfigured reverse proxy issues."}
{"job_id": "2fb03756-6416-4516-a1dd-75c825556e27", "name": "Restart Node Exporter Agent", "description": "Restart the Prometheus Node Exporter agent to fix missing or outdated system metrics and restore monitoring visibility."}
{"job_id": "253a1cc0-f3d5-4560-aabd-fb49c44cd5ba", "name": "Restart PostgreSQL Database", "description": "Restart PostgreSQL database service to recover from query deadlocks, slow transactions, failed client connections, or high database latency."}
{"job_id": "169636f3-8c05-44ff-b5f1-ae0173486d94", "name": "Scale CPU Limit for Container", "description": "Increase CPU limit or shares for a specific Docker container to handle high CPU usage alerts, improve container performance, and prevent throttling."}
